//COBOL1 JOB (POK,999),MGELINSKI,MSGLEVEL=(1,1),MSGCLASS=X,
// CLASS=A,NOTIFY=&SYSUID
/*JOBPARM SYSAFF=*
// JCLLIB ORDER=(IGY.SIGYPROC)
//*
//RUNIVP EXEC IGYWCLG,PARM.COBOL=RENT,REGION=1400K,
// PARM.LKED='LIST,XREF,LET,MAP'
//COBOL.STEPLIB DD DSN=IGY.SIGYCOMP,
// DISP=SHR
//COBOL.SYSIN DD *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLIVP1.
       AUTHOR. STUDENT PROGRAMMER.
       INSTALLATION. MY UNIVERSITY
       DATE-WRITTEN. JUL 27, 2004.
       DATE-COMPILED.
       /
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-390.
       OBJECT-COMPUTER. IBM-390.
       PROCEDURE DIVISION.
       DISPLAY "***** HELLO WORLD *****" UPON CONSOLE.
       STOP RUN
//GO.SYSOUT DD SYSOUT=*
//
