       IDENTIFICATION DIVISION.                                         00010001
       PROGRAM-ID. HELLO.                                               00020001
       ENVIRONMENT DIVISION.                                            00030001
       DATA DIVISION.                                                   00040001
       PROCEDURE DIVISION.                                              00050001
         MAIN-PARA.                                                     00060001
           DISPLAY 'Hello World'.                                       00070001
           STOP RUN.                                                    00080001
