//ZHELLO  JOB ,'HELLO WORLD',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//*
//JOBLIB    DD DSN=Z31821.LOAD,DISP=SHR
//*
//RUN1    EXEC PGM=HELLO
//SYSOUT    DD SYSOUT=*
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
//*
//RUN2    EXEC PGM=HELLO2
//SYSOUT    DD SYSOUT=*
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
//OUTPUT    DD DSN=Z31821.OUTPUT.HELLO,
//             DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//             SPACE=(TRK,(1,1),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=8000)
//SYSIN     DD DUMMY
