//JCOMPILE JOB 1,NOTIFY=&SYSUID
//***************************************************/
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(SR300A),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(SR300A),DISP=SHR